garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1615.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1OUTHL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PID1OUTHL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x598">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1OUT16" edc:desc="" edc:mask="0x1" edc:name="PID1OUT16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT17" edc:desc="" edc:mask="0x1" edc:name="PID1OUT17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT18" edc:desc="" edc:mask="0x1" edc:name="PID1OUT18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT19" edc:desc="" edc:mask="0x1" edc:name="PID1OUT19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT20" edc:desc="" edc:mask="0x1" edc:name="PID1OUT20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT21" edc:desc="" edc:mask="0x1" edc:name="PID1OUT21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT22" edc:desc="" edc:mask="0x1" edc:name="PID1OUT22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT23" edc:desc="" edc:mask="0x1" edc:name="PID1OUT23" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OUT16" edc:desc="" edc:mask="0x1" edc:name="OUT16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT17" edc:desc="" edc:mask="0x1" edc:name="OUT17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT18" edc:desc="" edc:mask="0x1" edc:name="OUT18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT19" edc:desc="" edc:mask="0x1" edc:name="OUT19" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT20" edc:desc="" edc:mask="0x1" edc:name="OUT20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT21" edc:desc="" edc:mask="0x1" edc:name="OUT21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT22" edc:desc="" edc:mask="0x1" edc:name="OUT22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT23" edc:desc="" edc:mask="0x1" edc:name="OUT23" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1OUTHH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PID1OUTHH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x599">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1OUT24" edc:desc="" edc:mask="0x1" edc:name="PID1OUT24" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT25" edc:desc="" edc:mask="0x1" edc:name="PID1OUT25" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT26" edc:desc="" edc:mask="0x1" edc:name="PID1OUT26" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT27" edc:desc="" edc:mask="0x1" edc:name="PID1OUT27" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT28" edc:desc="" edc:mask="0x1" edc:name="PID1OUT28" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT29" edc:desc="" edc:mask="0x1" edc:name="PID1OUT29" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT30" edc:desc="" edc:mask="0x1" edc:name="PID1OUT30" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT31" edc:desc="" edc:mask="0x1" edc:name="PID1OUT31" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OUT24" edc:desc="" edc:mask="0x1" edc:name="OUT24" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT25" edc:desc="" edc:mask="0x1" edc:name="OUT25" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT26" edc:desc="" edc:mask="0x1" edc:name="OUT26" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT27" edc:desc="" edc:mask="0x1" edc:name="OUT27" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT28" edc:desc="" edc:mask="0x1" edc:name="OUT28" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT29" edc:desc="" edc:mask="0x1" edc:name="OUT29" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT30" edc:desc="" edc:mask="0x1" edc:name="OUT30" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT31" edc:desc="" edc:mask="0x1" edc:name="OUT31" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----nnnn" edc:cname="PID1OUTU" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PID1OUTU" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x59A">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1OUT32" edc:desc="" edc:mask="0x1" edc:name="PID1OUT32" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT33" edc:desc="" edc:mask="0x1" edc:name="PID1OUT33" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT34" edc:desc="" edc:mask="0x1" edc:name="PID1OUT34" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1OUT35" edc:desc="" edc:mask="0x1" edc:name="PID1OUT35" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="OUT32" edc:desc="" edc:mask="0x1" edc:name="OUT32" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT33" edc:desc="" edc:mask="0x1" edc:name="OUT33" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT34" edc:desc="" edc:mask="0x1" edc:name="OUT34" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="OUT35" edc:desc="" edc:mask="0x1" edc:name="OUT35" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="PID1Z1" edc:desc="" edc:name="PID1Z1" edc:nzwidth="0x18" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x59B">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PID1Z1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PID1Z1L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02712_math_progmac_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x59B">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PID1Z10" edc:desc="" edc:mask="0x1" edc:name="PID1Z10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z11" edc:desc="" edc:mask="0x1" edc:name="PID1Z11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z12" edc:desc="" edc:mask="0x1" edc:name="PID1Z12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z13" edc:desc="" edc:mask="0x1" edc:name="PID1Z13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z14" edc:desc="" edc:mask="0x1" edc:name="PID1Z14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z15" edc:desc="" edc:mask="0x1" edc:name="PID1Z15" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z16" edc:desc="" edc:mask="0x1" edc:name="PID1Z16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PID1Z17" edc:desc="" edc:mask="0x1" edc:name="PID1Z17" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="Z10" edc:desc="" edc:mask="0x1" edc:name="Z10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z11" edc:desc="" edc:mask="0x1" edc:name="Z11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z12" edc:desc="" edc:mask="0x1" edc:name="Z12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z13" edc:desc="" edc:mask="0x1" edc:name="Z13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z14" edc:desc="" edc:mask="0x1" edc:name="Z14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z15" edc:desc="" edc:mask="0x1" edc:name="Z15" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z16" edc:desc="" edc:mask="0x1" edc:name="Z16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="Z17" edc:desc="" edc:mask="0x1" edc:name="Z17" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
