garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1615.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T0CKIPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T0CKIPPS" edc:nzwidth="8" edc:por="---00010" edc:_addr="0xE11">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T0CKIPPS" edc:desc="" edc:mask="0x1f" edc:name="T0CKIPPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T0CKIPPS0" edc:desc="" edc:mask="0x1" edc:name="T0CKIPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS1" edc:desc="" edc:mask="0x1" edc:name="T0CKIPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS2" edc:desc="" edc:mask="0x1" edc:name="T0CKIPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS3" edc:desc="" edc:mask="0x1" edc:name="T0CKIPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS4" edc:desc="" edc:mask="0x1" edc:name="T0CKIPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T1CKIPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T1CKIPPS" edc:nzwidth="8" edc:por="---00101" edc:_addr="0xE12">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T1CKIPPS" edc:mask="0x1f" edc:name="T1CKIPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T1CKIPPS0" edc:desc="" edc:mask="0x1" edc:name="T1CKIPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS1" edc:desc="" edc:mask="0x1" edc:name="T1CKIPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS2" edc:desc="" edc:mask="0x1" edc:name="T1CKIPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS3" edc:desc="" edc:mask="0x1" edc:name="T1CKIPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS4" edc:desc="" edc:mask="0x1" edc:name="T1CKIPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T1GPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T1GPPS" edc:nzwidth="8" edc:por="---00100" edc:_addr="0xE13">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T1GPPS" edc:mask="0x1f" edc:name="T1GPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T1GPPS0" edc:desc="" edc:mask="0x1" edc:name="T1GPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS1" edc:desc="" edc:mask="0x1" edc:name="T1GPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS2" edc:desc="" edc:mask="0x1" edc:name="T1GPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS3" edc:desc="" edc:mask="0x1" edc:name="T1GPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1GPPS4" edc:desc="" edc:mask="0x1" edc:name="T1GPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CCP1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CCP1PPS" edc:nzwidth="8" edc:por="---10101" edc:_addr="0xE14">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP1PPS" edc:mask="0x1f" edc:name="CCP1PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP1PPS0" edc:desc="" edc:mask="0x1" edc:name="CCP1PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS1" edc:desc="" edc:mask="0x1" edc:name="CCP1PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS2" edc:desc="" edc:mask="0x1" edc:name="CCP1PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS3" edc:desc="" edc:mask="0x1" edc:name="CCP1PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1PPS4" edc:desc="" edc:mask="0x1" edc:name="CCP1PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CCP2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CCP2PPS" edc:nzwidth="8" edc:por="---10011" edc:_addr="0xE15">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP2PPS" edc:mask="0x1f" edc:name="CCP2PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP2PPS0" edc:desc="" edc:mask="0x1" edc:name="CCP2PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2PPS1" edc:desc="" edc:mask="0x1" edc:name="CCP2PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2PPS2" edc:desc="" edc:mask="0x1" edc:name="CCP2PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2PPS3" edc:desc="" edc:mask="0x1" edc:name="CCP2PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2PPS4" edc:desc="" edc:mask="0x1" edc:name="CCP2PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="ATINPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="ATINPPS" edc:nzwidth="8" edc:por="---10101" edc:_addr="0xE16">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ATINPPS" edc:mask="0x1f" edc:name="ATINPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ATINPPS0" edc:desc="" edc:mask="0x1" edc:name="ATINPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATINPPS1" edc:desc="" edc:mask="0x1" edc:name="ATINPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATINPPS2" edc:desc="" edc:mask="0x1" edc:name="ATINPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATINPPS3" edc:desc="" edc:mask="0x1" edc:name="ATINPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATINPPS4" edc:desc="" edc:mask="0x1" edc:name="ATINPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CWG1INPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CWG1INPPS" edc:nzwidth="8" edc:por="---00010" edc:_addr="0xE17">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CWGINPPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CWG1INPPS" edc:mask="0x1f" edc:name="CWG1INPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWGINPPS0" edc:desc="" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS1" edc:desc="" edc:mask="0x1" edc:name="CWGINPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS2" edc:desc="" edc:mask="0x1" edc:name="CWGINPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS3" edc:desc="" edc:mask="0x1" edc:name="CWGINPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS4" edc:desc="" edc:mask="0x1" edc:name="CWGINPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1INPPS0" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS1" edc:mask="0x1" edc:name="CWG1INPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS2" edc:mask="0x1" edc:name="CWG1INPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS3" edc:mask="0x1" edc:name="CWG1INPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS4" edc:mask="0x1" edc:name="CWG1INPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
